In [53]:
'''
Program performs data analysis using pandas.
Author: Sanjay Reddy Muthyala
'''

'\nProgram performs data analysis using pandas.\nAuthor: Sanjay Reddy Muthyala\n'

In [54]:
import numpy as np 
import pandas as pd

In [55]:
titanic = pd.read_csv('titanic.csv')

#size of the dataset
titanic.shape

(1309, 5)

In [56]:
#summary of data-frame
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            1309 non-null   object
 1   survived        1309 non-null   object
 2   sex             1309 non-null   object
 3   age             1046 non-null   float64
 4   passengerClass  1309 non-null   object
dtypes: float64(1), object(4)
memory usage: 51.3+ KB

In [57]:
# Checking first 10 rows of dataframe 
print(titanic.head(10))

                              Name survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st
5              Anderson, Mr. Harry      yes    male  48.0000            1st
6  Andrews, Miss. Kornelia Theodos      yes  female  63.0000            1st
7           Andrews, Mr. Thomas Jr       no    male  39.0000            1st
8  Appleton, Mrs. Edward Dale (Cha      yes  female  53.0000            1st
9          Artagaveytia, Mr. Ramon       no    male  71.0000            1st

In [58]:
titanic.isnull().sum()

Name                0
survived            0
sex                 0
age               263
passengerClass      0
dtype: int64

## a) Number of passengers on titanic.

In [59]:
print('Passengers in titanic : ',end = '') 
print(df.shape[0])

Passengers in titanic : 1309

## b. Male and Female passengers count

In [60]:
print('Number of male and female passengers') 
print(titanic['sex'].value_counts())

Number of male and female passengers
male      843
female    466
Name: sex, dtype: int64

## c. Average age of all passengers

In [61]:
print('Avarage age of all passengers:',end=' ') 
print(round(titanic['age'].mean(),2))

Avarage age of all passengers: 29.88

## d. Number of passengers of age less than 21 years

In [62]:
print('Total number of passengers of age less than 21:',end=' ') 
print(titanic[titanic['age'] < 21].shape[0])

Total number of passengers of age less than 21: 249

## e. Number of male & female who survived and not survived

In [63]:
print('Number of people who survived and not survived')
print(titanic['survived'].value_counts())

print('Number of males and females who survived and not survived :') 
print(titanic.groupby(['survived', 'sex']).size())

Number of people who survived and not survived
no     809
yes    500
Name: survived, dtype: int64
Number of males and females who survived and not survived :
survived  sex
no        female    127
          male      682
yes       female    339
          male      161
dtype: int64

##  f. The youngest age and the oldest age of the passenger who survived.

In [64]:
print('Youngest age of survived :',end=' ')
print(titanic[titanic['survived'] == 'yes']['age'].min())
print('Oldest age of survived :',end=' ')
print(titanic[titanic['survived'] == 'yes']['age'].max())
x = titanic[titanic['survived'] == 'yes']['age'].min()
y = titanic[titanic['survived'] == 'yes']['age'].max()
print('Name of yongest survived passenger:') 
print(titanic[titanic['age']==x]['Name']) 
print('Name of oldest survived passenger:') 
print(titanic[titanic['age']==y]['Name'])

Youngest age of survived : 0.166700006
Oldest age of survived : 80.0
Name of yongest survived passenger:
763    Dean, Miss. Elizabeth Gladys M
Name: Name, dtype: object
Name of oldest survived passenger:
14    Barkworth, Mr. Algernon Henry W
Name: Name, dtype: object

## g. List of passengers who survived.

In [65]:
print('Name of all passengers who survived') 
print(titanic[titanic['survived'] =='yes']['Name'])

Name of all passengers who survived
0         Allen, Miss. Elisabeth Walton
1        Allison, Master. Hudson Trevor
5                   Anderson, Mr. Harry
6       Andrews, Miss. Kornelia Theodos
8       Appleton, Mrs. Edward Dale (Cha
                     ...
1261             Turkula, Mrs. (Hedwig)
1277               Vartanian, Mr. David
1286    Whabee, Mrs. George Joseph (Sha
1290    Wilkes, Mrs. James (Ellen Needs
1300    Yasbeck, Mrs. Antoni (Selini Al
Name: Name, Length: 500, dtype: object